Firma/nalog_encrypted_and_signed.xml

<?xml version="1.0" encoding="UTF-8" standalone="no"?><SOAP-ENV:Envelope xmlns:SOAP-ENV="http://schemas.xmlsoap.org/soap/envelope/"><SOAP-ENV:Header/><SOAP-ENV:Body><ns2:getNalogZaPlacanjeRequest xmlns:ns2="http://nalogZaPlacanje.com"><xenc:EncryptedData xmlns:xenc="http://www.w3.org/2001/04/xmlenc#" Type="http://www.w3.org/2001/04/xmlenc#Content"><xenc:EncryptionMethod Algorithm="http://www.w3.org/2001/04/xmlenc#tripledes-cbc"/><ds:KeyInfo xmlns:ds="http://www.w3.org/2000/09/xmldsig#">
<ds:KeyName>Sifrovan tajni kljuc</ds:KeyName>
<xenc:EncryptedKey><xenc:EncryptionMethod Algorithm="http://www.w3.org/2001/04/xmlenc#rsa-1_5"/><xenc:CipherData><xenc:CipherValue>MfmWN+SwcLhrng1W7rPC0i+pc4eCvyf3O5X+CWUYxe+44P8FudTnVNcE9Sywa3RP/uLazelS+I2Z&#13;
+OffKfQEJEkAZoO/bH2a+UxQC6DErafd+DQMW76qQ77rQReCVS6ZJIltcbVE4OcoI0ZiMz4dnpRY&#13;
/10qyUxD/Yf+kUSTaKo=</xenc:CipherValue></xenc:CipherData></xenc:EncryptedKey></ds:KeyInfo><xenc:CipherData><xenc:CipherValue>gk18esumADhTzVRNWGlTF54Aa9+CjluffdX9Q7kGuRPeIbzp/WNNGsVkU8zIvQLe0GSWrwZRYJOc&#13;
eeCWEz3l5gXgJO9giBdvpgj99QycWUBDLkoIZRFzQZL8fSsSzbx5DbxbHJGAxg2+lM0AjJPIVK1S&#13;
pYForhI9UEBII0nV/QMM4o0zgi7vbn+wqF4Q4Di63g/S4xAEhxYfSep4aAuiprLczF0FJDxIiewB&#13;
IHXhV+7QPw2YAOAhgl/ie5zZXg93rs9FgBhtr7nuK/7U8q1ea6jsVkD1+HJ5TUpYS3JuV4PoWZ2x&#13;
gbd1i1hOcyUggayD1Qj8uOO7tZ7fr10h5SHPb8PO3IyKrGHfGdd4oCA1yIVpZbAUnJ8HGb2koSWQ&#13;
nnHJORKAsqGdbBGlAnfF3HAo4NgP9YFS3/eAbTVBJHU7R1ZwudXXppo+CPjyAlVgRBQshr/9xYs5&#13;
s8chbz1drEAkzAEyTIYx/m5anwooSlfriAvjrzhhs71EXvNjI8cvR2aY/S7FqctEVx6fiHjqc1aX&#13;
JQhWZbT7WFD7k7jo+Qs5+IvXWeR1ZVGM6UvWTcNB4FVyHv3Hh2h6Yilba+wtRO5koRmYMY37XQzd&#13;
U9Np5Ss93WNgyZ90X8h4bcq5Hzxyg4HUCzfYuJdFRya1cpFEaKfg4m3y1YwgmjQUhtqHXJCy9aXK&#13;
IshmxoenxU5vDt97IVVgzyPVuopDDCy1uYFJXlsk/lmqLaJbc1s4YJAgUwWFdKkzJdrndGG3Ws3J&#13;
CY5DuF0nwtrEzo1IJkE4FTDv3zAeqj1d0MOABBK7dhNESK22+7/pUCDdR8VK57v8bRwMKMhHqGbg&#13;
+BnMZYuVKLBT3YVLI4L139TlT6kKB7J29JbU375wulSzvnbR2Sz/CGfUl9sc2B6aGx7bA11mkZt3&#13;
BgRFM4FSB8csjgOTH+/NSDjCmAHBBs+k3tClyG1JYLTIDBxM</xenc:CipherValue></xenc:CipherData></xenc:EncryptedData></ns2:getNalogZaPlacanjeRequest></SOAP-ENV:Body><ds:Signature xmlns:ds="http://www.w3.org/2000/09/xmldsig#">
<ds:SignedInfo>
<ds:CanonicalizationMethod Algorithm="http://www.w3.org/TR/2001/REC-xml-c14n-20010315"/>
<ds:SignatureMethod Algorithm="http://www.w3.org/2000/09/xmldsig#rsa-sha1"/>
<ds:Reference URI="">
<ds:Transforms>
<ds:Transform Algorithm="http://www.w3.org/2000/09/xmldsig#enveloped-signature"/>
<ds:Transform Algorithm="http://www.w3.org/TR/2001/REC-xml-c14n-20010315#WithComments"/>
</ds:Transforms>
<ds:DigestMethod Algorithm="http://www.w3.org/2000/09/xmldsig#sha1"/>
<ds:DigestValue>ioZC5RHikgEShSxkaJP0BGmtDdc=</ds:DigestValue>
</ds:Reference>
</ds:SignedInfo>
<ds:SignatureValue>
tweU0sddwbKzZu2hrTjKjc41a4KuRkmNrdP8dix809/P0J4uOIFRcLFlfwyVjssdTpkzdEmlkPt+&#13;
RZAowDjYPcu8tfRl2J+iRr8ctTCCCqxnx1aDsFP2/vhruMBiX9BK9ImOfZCipspb6safXqwQAk4l&#13;
2MG98NjF0zvLmYWRuEg=
</ds:SignatureValue>
<ds:KeyInfo>
<ds:KeyValue>
<ds:RSAKeyValue>
<ds:Modulus>
zQ9KJLShafi/S2HkWlfnRpKcuLB4BgeJ5y2wBafGRRNz5kss0gjzzQZIDf684gwQ2WYEDlH2s+OX&#13;
fbX4v6KTKJ4ug0wfY05sciJ7Dx+HOPUw6KU5aWvbBIKAXJE+MCSaO/FSk+ujgXSZAY/epUsSqBo2&#13;
EZgUl90oEpTRbV+xX8E=
</ds:Modulus>
<ds:Exponent>AQAB</ds:Exponent>
</ds:RSAKeyValue>
</ds:KeyValue>
<ds:X509Data>
<ds:X509Certificate>
MIIBtjCCAR8CBEZasCQwDQYJKoZIhvcNAQEFBQAwIjEPMA0GA1UECwwGcHJpbWVyMQ8wDQYDVQQD&#13;
DAZwcmltZXIwHhcNMDcwNTI4MTAzNDEyWhcNMjcwNTIzMTAzNDEyWjAiMQ8wDQYDVQQLDAZwcmlt&#13;
ZXIxDzANBgNVBAMMBnByaW1lcjCBnzANBgkqhkiG9w0BAQEFAAOBjQAwgYkCgYEAzQ9KJLShafi/&#13;
S2HkWlfnRpKcuLB4BgeJ5y2wBafGRRNz5kss0gjzzQZIDf684gwQ2WYEDlH2s+OXfbX4v6KTKJ4u&#13;
g0wfY05sciJ7Dx+HOPUw6KU5aWvbBIKAXJE+MCSaO/FSk+ujgXSZAY/epUsSqBo2EZgUl90oEpTR&#13;
bV+xX8ECAwEAATANBgkqhkiG9w0BAQUFAAOBgQB2HjPI427zRaVfLTaeNVcjH9hoTkl9OUJAAmEa&#13;
6EQdbdqZ75ca3IfuLHJFJ8zzyBP4LUGSxgA4OpnKs6Ej5w2n0GHmu0g4YqxInfpv/kCwswoia4Oz&#13;
a17te8mMamffCn3ySX5yZzEex5nueNAyhJkmWBcBCOvJw4+U+gSK50Xbcw==
</ds:X509Certificate>
</ds:X509Data>
</ds:KeyInfo>
</ds:Signature></SOAP-ENV:Envelope>